<template>
	<div class="book-grid">
		<DoubanBook :book="book" v-for="book in books" :key="book.id" />
	</div>
</template>

<script>
import DoubanBook from "../components/MainSection/DoubanBook.vue";
export default {
	name: "BookShelf",
	components: {
		DoubanBook,
	},
	setup() {
		const books = [
			{
				id: "9787559652317",
				title: "从零开始的女性主义",
				rating: 8.9,
				rawAuthor: " [日] 上野千鹤子 / [日] 田房永子",
				publisher: "北京联合出版公司",
				publishDate: "2021-9",
				image: "/originals/bag.jpeg",
				summary: `◎日本女性主义理论第一人、《厌女》作者上野千鹤子 面向普通读者的女性主义普及课

◎女性为何如此艰难？女性如何奋斗至今？又该如何奋斗？

◎工作、婚恋、育儿，该如何以女性主义的角度思考？

——————

【编辑推荐】

※2019年东京大学入学演讲《等待着你的是即使努力也无法获得回报 的社会》引发热议，使上野千鹤子成为了明星学者与作家。本书是继《厌女》《父权制与资本主义》在中国出版之后，她备受期待的新作。

※本书也是上野千鹤子的第一本面向普通读者的女性主义普及读物。不像她比较艰深的学术著作，本书语言幽默平实、通俗易懂，在轻松的对谈形式中向大众普及女性主义的内涵、历史，以及如何以女性主义角度思考日常中的工作、婚恋、育儿问题。

※本书内容触及现代女性所关心的核心问题，揭示了在当今社会中女性仍然面对的诸多不公与困境。上野千鹤子从自身的经历着手，将女性主义放置在个人生活的背景中，告诉我们女性主义不仅仅关乎女性，更关乎每个人的日常生活。

※本书辅以日本人气漫画家田房永子的漫画，让读者在轻松愉悦的氛围中，接受一次女性主义的洗礼。

——————

【内容简介】

女性主义是什么？为什么我们需要女性主义？如何用女性主义进行思考？

围绕上述种种问题，日本著名学者上野千鹤子与知名漫画家田房永子，开始了一场从零开始的女性主义课堂。她们用幽默的语言、传神的漫画，回溯女性主义的发展历程，畅谈母女关系、性、工作、婚恋、育儿等日常生活中的议题，驳斥关于女性的刻板偏见。

这堂课不仅开启了一趟全新的旅程，更告诉我们：女性主义，不仅仅关乎女性，更关乎每个人的日常生活。`,
			},
			{
				id: "9787559652317",
				title: "从零开始的女性主义",
				rating: 8.9,
				rawAuthor: " [日] 上野千鹤子 / [日] 田房永子",
				publisher: "北京联合出版公司",
				publishDate: "2021-9",
				image: "/originals/bag.jpeg",
				summary: `◎日本女性主义理论第一人、《厌女》作者上野千鹤子 面向普通读者的女性主义普及课

◎女性为何如此艰难？女性如何奋斗至今？又该如何奋斗？

◎工作、婚恋、育儿，该如何以女性主义的角度思考？

——————

【编辑推荐】

※2019年东京大学入学演讲《等待着你的是即使努力也无法获得回报 的社会》引发热议，使上野千鹤子成为了明星学者与作家。本书是继《厌女》《父权制与资本主义》在中国出版之后，她备受期待的新作。

※本书也是上野千鹤子的第一本面向普通读者的女性主义普及读物。不像她比较艰深的学术著作，本书语言幽默平实、通俗易懂，在轻松的对谈形式中向大众普及女性主义的内涵、历史，以及如何以女性主义角度思考日常中的工作、婚恋、育儿问题。

※本书内容触及现代女性所关心的核心问题，揭示了在当今社会中女性仍然面对的诸多不公与困境。上野千鹤子从自身的经历着手，将女性主义放置在个人生活的背景中，告诉我们女性主义不仅仅关乎女性，更关乎每个人的日常生活。

※本书辅以日本人气漫画家田房永子的漫画，让读者在轻松愉悦的氛围中，接受一次女性主义的洗礼。

——————

【内容简介】

女性主义是什么？为什么我们需要女性主义？如何用女性主义进行思考？

围绕上述种种问题，日本著名学者上野千鹤子与知名漫画家田房永子，开始了一场从零开始的女性主义课堂。她们用幽默的语言、传神的漫画，回溯女性主义的发展历程，畅谈母女关系、性、工作、婚恋、育儿等日常生活中的议题，驳斥关于女性的刻板偏见。

这堂课不仅开启了一趟全新的旅程，更告诉我们：女性主义，不仅仅关乎女性，更关乎每个人的日常生活。`,
			},
			{
				id: "9787559652317",
				title: "从零开始的女性主义",
				rating: 8.9,
				rawAuthor: " [日] 上野千鹤子 / [日] 田房永子",
				publisher: "北京联合出版公司",
				publishDate: "2021-9",
				image: "/originals/bag.jpeg",
				summary: `◎日本女性主义理论第一人、《厌女》作者上野千鹤子 面向普通读者的女性主义普及课

◎女性为何如此艰难？女性如何奋斗至今？又该如何奋斗？

◎工作、婚恋、育儿，该如何以女性主义的角度思考？

——————

【编辑推荐】

※2019年东京大学入学演讲《等待着你的是即使努力也无法获得回报 的社会》引发热议，使上野千鹤子成为了明星学者与作家。本书是继《厌女》《父权制与资本主义》在中国出版之后，她备受期待的新作。

※本书也是上野千鹤子的第一本面向普通读者的女性主义普及读物。不像她比较艰深的学术著作，本书语言幽默平实、通俗易懂，在轻松的对谈形式中向大众普及女性主义的内涵、历史，以及如何以女性主义角度思考日常中的工作、婚恋、育儿问题。

※本书内容触及现代女性所关心的核心问题，揭示了在当今社会中女性仍然面对的诸多不公与困境。上野千鹤子从自身的经历着手，将女性主义放置在个人生活的背景中，告诉我们女性主义不仅仅关乎女性，更关乎每个人的日常生活。

※本书辅以日本人气漫画家田房永子的漫画，让读者在轻松愉悦的氛围中，接受一次女性主义的洗礼。

——————

【内容简介】

女性主义是什么？为什么我们需要女性主义？如何用女性主义进行思考？

围绕上述种种问题，日本著名学者上野千鹤子与知名漫画家田房永子，开始了一场从零开始的女性主义课堂。她们用幽默的语言、传神的漫画，回溯女性主义的发展历程，畅谈母女关系、性、工作、婚恋、育儿等日常生活中的议题，驳斥关于女性的刻板偏见。

这堂课不仅开启了一趟全新的旅程，更告诉我们：女性主义，不仅仅关乎女性，更关乎每个人的日常生活。`,
			},
			{
				id: "9787559652317",
				title: "从零开始的女性主义",
				rating: 8.9,
				rawAuthor: " [日] 上野千鹤子 / [日] 田房永子",
				publisher: "北京联合出版公司",
				publishDate: "2021-9",
				image: "/originals/bag.jpeg",
				summary: `◎日本女性主义理论第一人、《厌女》作者上野千鹤子 面向普通读者的女性主义普及课

◎女性为何如此艰难？女性如何奋斗至今？又该如何奋斗？

◎工作、婚恋、育儿，该如何以女性主义的角度思考？

——————

【编辑推荐】

※2019年东京大学入学演讲《等待着你的是即使努力也无法获得回报 的社会》引发热议，使上野千鹤子成为了明星学者与作家。本书是继《厌女》《父权制与资本主义》在中国出版之后，她备受期待的新作。

※本书也是上野千鹤子的第一本面向普通读者的女性主义普及读物。不像她比较艰深的学术著作，本书语言幽默平实、通俗易懂，在轻松的对谈形式中向大众普及女性主义的内涵、历史，以及如何以女性主义角度思考日常中的工作、婚恋、育儿问题。

※本书内容触及现代女性所关心的核心问题，揭示了在当今社会中女性仍然面对的诸多不公与困境。上野千鹤子从自身的经历着手，将女性主义放置在个人生活的背景中，告诉我们女性主义不仅仅关乎女性，更关乎每个人的日常生活。

※本书辅以日本人气漫画家田房永子的漫画，让读者在轻松愉悦的氛围中，接受一次女性主义的洗礼。

——————

【内容简介】

女性主义是什么？为什么我们需要女性主义？如何用女性主义进行思考？

围绕上述种种问题，日本著名学者上野千鹤子与知名漫画家田房永子，开始了一场从零开始的女性主义课堂。她们用幽默的语言、传神的漫画，回溯女性主义的发展历程，畅谈母女关系、性、工作、婚恋、育儿等日常生活中的议题，驳斥关于女性的刻板偏见。

这堂课不仅开启了一趟全新的旅程，更告诉我们：女性主义，不仅仅关乎女性，更关乎每个人的日常生活。`,
			},
		];
		return {
			books,
		};
	},
};
</script>

<style></style>
